#include "../../include/yrfs.h"

/*
 *=======================================================================================
 *icreat関数
 *inodeを作る関数
 *引数
 *char *
 *ファイル名
 *=======================================================================================
 */
struct i_node icreat(char *file_name) {
	struct i_node inode;
      u32_t i = 0;

	/*
	 *まずファイル名をコピー
	 */
	while(*file_name != '\0'){
		inode.file_name[i] = *file_name;
		i++;
	}

	/*
	 *次にファイル割り当て
	 */
	i = __FILE_OBJECT_ZONE__;
	while(blocks_info[i].empty)
		i++;
	/*
	 *今の所、隙間に割り当てるようなスキルは無いのでからのセクタにそのまま
	 */
	inode.address.offset = 0;
	inode.address.sector = i;

	return inode;
}

/*
 *=======================================================================================
 *inode情報を記憶装置に書き込む
 *=======================================================================================
 */
void iwrite(struct i_node *inode) {
	
}
