#include "../include/elf.h"

/*
 *=======================================================================================
 *CheckELF関数
 *この実行ファイルが正式なELFか判定する関数
 *=======================================================================================
 */
u8_t CheckELF(struct Elf32_info *elf){
	return (elf->e_ident[0] == 0x7f && elf->e_ident[1] == 'E' && elf->e_ident[2] == 'L' && elf->e_ident[3] == 'F')
		?
		1 : 0;
}

/*
 *=======================================================================================
 *CutELFSectionHeader関数
 *ELF構造体からセクションヘッダを切り取る関数
 *=======================================================================================
 */
struct Elf32_Shdr *CutELFSectionHeader(struct Elf32_info *elf){
	return (struct Elf32_Shdr *)((char *)elf + elf->e_shoff);
}

/*
 *=======================================================================================
 *CutELFSectionHeader関数
 *ELF構造体からプログラムヘッダを切り取る関数
 *=======================================================================================
 */
struct Elf32_Phdr *CutELFProgramHeader(struct Elf32_info *elf){
	return (struct Elf32_Phdr *)((char *)elf + elf->e_phoff);
}
