#ifndef __YRFS_H__
#define __YRFS_H__

#include "types.h"

/*
 *=======================================================================================
 *openシステムコールのフラグ
 *=======================================================================================
 */
#define __O_RDONLY__ 0x01
#define __O_WRONLY__ 0x02
#define __O_RDWR__   0x04
#define __O_CREAT__  0x08

/*
 *=======================================================================================
 *seekシステムコールのフラグ
 *=======================================================================================
 */
#define __SEEK_SET__ 0x00
#define __SEEK_CUR__ 0x01
#define __SEEK_END__ 0x02

#define __INODE_ZONE__        0
#define __FILE_OBJECT_ZONE__ 20

#define __WRITABLE_INODE_SIZE__ 68
#define __WRITABLE_INODE_SECTORS__ 2

#define __UNUSED_BLOCK__ 0x01
#define __USED_BLOCK__   0x00

typedef unsigned int off_t;

/*
 *=======================================================================================
 *ブロックの情報を保持しておく構造体
 *=======================================================================================
 */
struct block_info {
	/*
	 *このブロックは空か？
	 */
	u32_t empty : 1;
};

/*
 *=======================================================================================
 *ファイルがファイルシステムのどこに位置するかを保持する構造体
 *=======================================================================================
 */
struct fs_address {
	u32_t sector;
	u32_t offset;
};

/*
 *=======================================================================================
 *inode構造体
 *=======================================================================================
 */
struct i_node {
	//inodeID
	u32_t id;
	//ファイルのアドレス
	struct fs_address address;
	//ファイルのサイズ
	u32_t size;
	//ファイル名
	char file_name[256];
};

/*
 *=======================================================================================
 *書き込み可能な形式のデータを保持する構造体
 *=======================================================================================
 */
struct writable_data {
	u32_t size;
	u32_t *data;
};

/*
 *ブロックの情報を保持しておく
 */
extern struct block_info blocks_info[100];

//inodeを作る関数
struct i_node icreat(char *file_name);

/*
 *=======================================================================================
 *new_wrdata関数
 *新しくwritable_data構造体を確保する関数
 *=======================================================================================
 */
void new_wrdata(struct writable_data *data, u32_t size);

/*
 *=======================================================================================
 *delete_wrdata関数
 *writable_data構造体を開放する関数
 *=======================================================================================
 */
void delete_wrdata(struct writable_data *data);

/*
 *=======================================================================================
 *iwrite関数
 *inode情報を補助記憶装置に書き込む
 *=======================================================================================
 */
u32_t iwrite(struct i_node *inode);
void iread(struct i_node *inode, u32_t index);

/*
 *=======================================================================================
 *u32to4char関数
 *unsigned intの中に入った4つの文字列を取り出す関数
 *=======================================================================================
 */
void u32to4char(u32_t data, char *buffer);

/*
 *=======================================================================================
 *char4tou32関数
 *unsigned intの中に入った4つの文字列を取り出す関数
 *=======================================================================================
 */
void char4tou32(char *data, u32_t *u32);

int do_open(char *pathname, u32_t flags);
off_t do_seek(int fd, off_t offset, int whence);
u32_t do_stat(int fd, u32_t *box);
i32_t do_close(i32_t fd);

#endif
